Tekla Open API Reference for Tekla Structures 2025
ModelObjectVisualization.SetTransparencyForAll Method
 Restores permanent representation settings and sets temporary transparency for all model objects
 Namespace: Tekla.Structures.Model.UI
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public static bool SetTransparencyForAll(
	TemporaryTransparency transparency
)
Public Shared Function SetTransparencyForAll (
	transparency As TemporaryTransparency
) As Boolean
Parameters
transparency
Type: Tekla.Structures.Model.UI.TemporaryTransparency
The temporary transparency for all model objects.
Return Value
Type: Boolean
True if the temporary transparency could be set.
See Also
Reference
ModelObjectVisualization Class
Tekla.Structures.Model.UI Namespace